In [15]:
import pandas as pd
d1 = pd.DataFrame({"roll_no":[1,2,3,4,5],"name":["Prathamesh","divyesh","aditya","prasad","omkar"]})
d2 = pd.DataFrame({"roll_no":[1,2,3,4,5],"marks":[100,0,20,30,40]})

pd.merge(d1,d2,on="roll_no")

   roll_no        name  marks
0        1  Prathamesh    100
1        2     divyesh      0
2        3      aditya     20
3        4      prasad     30
4        5       omkar     40

In [17]:
df = pd.DataFrame({"roll_no":[1,2,3,4,5],"name":["Prathamesh","divyesh","aditya","prasad","omkar"],"marks":[100,0,20,30,40]})
df.pivot(index="roll_no", columns="name", values="marks")

name     Prathamesh  aditya  divyesh  omkar  prasad
roll_no
1             100.0     NaN      NaN    NaN     NaN
2               NaN     NaN      0.0    NaN     NaN
3               NaN    20.0      NaN    NaN     NaN
4               NaN     NaN      NaN    NaN    30.0
5               NaN     NaN      NaN   40.0     NaN

In [23]:
df = pd.DataFrame({"roll_no":[1,2,None,4,None],"name":[None,"divyesh","aditya",None,"omkar"],"marks":[100,0,20,30,40]})
# df.backfill(axis=0)
df.ffill(axis=0)

   roll_no     name  marks
0      1.0     None    100
1      2.0  divyesh      0
2      2.0   aditya     20
3      4.0   aditya     30
4      4.0    omkar     40

In [51]:
df1=pd.read_excel("/home/ubuntu/TCOB35/DSBDAL/data.xlsx")
d= df1.groupby('Gender')
d.first()

        Sr.\nno. Roll No        Name of the Student  DM   FDS  OOP  CG DELD
Gender
F              1  SCOA01              ALISHA SHEIKH  24  27.0   20  15   16
M              2  SCOA02  SOHAM JAYYANNTH DESHMUKKH  16   9.0    9  AB   AB

In [63]:
import numpy as np 

df1 = df1.replace(to_replace=np.nan , value=20)

df1 = df1.replace(to_replace="AB" , value=0)

# Now compute the correlation
correlation = df1['DM'].corr(df1['DELD'])
print(correlation)

-0.06038332494636658

In [47]:
d.count()

        Sr.\nno.  Roll No  Name of the Student  DM  FDS  OOP  CG  DELD
Gender
F              9        9                    9   9    8    9   9     9
M             12       12                   12  12   12   12  12    12

In [65]:
df1['DM'].describe()

count    21.000000
mean     19.904762
std       3.192253
min      12.000000
25%      18.000000
50%      20.000000
75%      22.000000
max      24.000000
Name: DM, dtype: float64

In [67]:
df1['DM'].drop_duplicates()

0     24
1     16
2     20
3     18
6     22
16    12
Name: DM, dtype: int64